{"id":2486,"date":"2023-08-12T09:39:58","date_gmt":"2023-08-12T09:39:58","guid":{"rendered":"https:\/\/drrealty.in\/?p=2486"},"modified":"2023-08-12T09:40:00","modified_gmt":"2023-08-12T09:40:00","slug":"wave-city-veridia-is-a-luxury-residential-project","status":"publish","type":"post","link":"https:\/\/drrealty.in\/wave-city-veridia-is-a-luxury-residential-project\/","title":{"rendered":"Wave City Veridia Is A Luxury Residential Project"},"content":{"rendered":"\n<p>Wave City Veridia is a residential project which adds ultra-luxurious residency that has 4 BHK and 5 BHK Sky villas. The residential project is with an approach from the 57-meter wide road that gives easy access. The residential project has sprawling lush greens that well planned thoughtful layouts. Its immaculate design and well-planned specifications make it easy to live. The residential project is with well develop location at NH-24. The residential project adds safety in the form of a home automation system and makes a considerable saving on electricity too. The project adds front door digital locks and includes video door phones as safety measures.<br>Wave City Veridia is with 5 BHK Sky Villas that has grand double height ceiling. It adds to modern-day luxuries and it further exceeds your lifestyle aspirations. The project has lavish 4 BHK floors that come with chic living spaces, 4 grand bedrooms, and modern fittings. The project adds contemporary lifestyle homes and it adds with best of design, comfort, and luxury. It has project amenities such as a clubhouse, gym, and swimming pool. It adds party lawns, a jogging track, restaurants, and a bar. It has a yoga and meditation center, restaurants and bars, a party hall, and power backup. It also adds a sports facility and a kids’ play area. The project is 3 beautiful parks that make it look stunningly beautiful.<\/p>\n\n\n\n<p>Wave City Veridia is with 4 BHK floor area that has a carpet area of 1675 sq ft. It has a Sky Villa with a carpet area of 1471 sq ft. The Sky Villas with an upper floor that has a carpet area of 863 sq ft. The project is with double height beautifully build and majestic drawings and ceiling heights. It adds provision for a home automation system. The project offers electric vehicle charging points in each of the parking. It has a private splash pool in every Sky Villa. It has a beautiful sky garden that is on the 6th-floor terrace of Sky Villas. The project adds only 2 apartments on each floor. It has only 2 apartments on each floor. It adds with 13 ft wardrobe that is with designated dressing space.<\/p>\n\n\n\n<p>Wave City Veridia is one of the first smart city systems with new and exclusive features. It adds soaring high ceilings and superior modular kitchens. It comes with fiber optic connectivity, and 24\/7 CCTV surveillance. The project adds automated water management, waste management, street light automation, waste management, a central command center, and a smart metering system. It has homeland security management too. The project boasts superior air quality.<\/p>\n\n\n\n<p>Wave City Veridia is with ultra 4 BHK floors and 5 BHK Sky Villas for Rs 1.31 Crore. It has specifications for lift lobby floors with Italian marble. It has lift fascia cladding with Italian marble. The staircase floors with Italian marble. The living and dining with POP punning, and vitrified tiles on the skirting and ceiling. The bedrooms have UPVC doors and windows with clear toughened glass. It is some of the best residences to invest in it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Wave City Veridia is a residential project which adds ultra-luxurious residency that has 4 BHK and 5 BHK Sky villas. The residential project is with an approach from the 57-meter wide road that gives easy access. The residential project has sprawling lush greens that well planned thoughtful layouts. Its immaculate design and well-planned specifications make [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_joinchat":[]},"categories":[23],"tags":[24],"_links":{"self":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2486"}],"collection":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/comments?post=2486"}],"version-history":[{"count":1,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2486\/revisions"}],"predecessor-version":[{"id":2487,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2486\/revisions\/2487"}],"wp:attachment":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/media?parent=2486"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/categories?post=2486"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/tags?post=2486"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}