{"id":2492,"date":"2023-08-17T09:36:31","date_gmt":"2023-08-17T09:36:31","guid":{"rendered":"https:\/\/drrealty.in\/?p=2492"},"modified":"2023-08-17T09:36:33","modified_gmt":"2023-08-17T09:36:33","slug":"tarc-tripundra-live-in-the-heart-of-delhi","status":"publish","type":"post","link":"https:\/\/drrealty.in\/tarc-tripundra-live-in-the-heart-of-delhi\/","title":{"rendered":"TARC Tripundra: Live In The Heart Of Delhi"},"content":{"rendered":"\n<p>Tripundra- The name of the project has been chosen very smartly, the property not just attracts the investors but the name also catches the attention of the market. Tripundra is the spiritual symbol of Lord Shiva. You must have seen the three white horizontal lines with a red dot in the center.<\/p>\n\n\n\n<p>Sacred ash is used to make the lines and then put on the forehead, chest, and hand, where one wishes to. The symbol is considered to clean all the sins whoever marks this on the body. The three lines represent the three intentions of man, namely, Kriya Shakti (power of work), Iccha Shakti (power of the will), and Gyana shakti (power of knowledge). All the accumulated sins of life can be removed by applying Tripundra.<\/p>\n\n\n\n<p>This concludes that Tripundra is all about purity and peace eradicating all the negativities, similarly, the builder has planned the project providing the living aura of the community- positive and happening bringing smiles and abundance in the life of residents.<\/p>\n\n\n\n<p>On that note, it is imperative to know about the builder.<\/p>\n\n\n\n<p>Welcome To TARC- The Anant Raj Corporation<\/p>\n\n\n\n<p>With the thought of spreading out and providing the best, this builder has come up with strong capabilities in conceptualizing and executing the projects. Established over four decades this builder has expanded the arms in the entire area of Delhi-NCR.<\/p>\n\n\n\n<p>40 years of experience<br>300 acres of land in New Delhi<br>550 acres of land in Delhi NCR<br>More than 20Mn Sq. ft already delivered<br>Each project is made with the vision of bringing a strong asset to a market where the investments are always beneficial. The team has a deep understanding of this dynamic market and how, when, and where to play. TARC has created landmarks in prime locations bringing benefits and wealth. Having projects in eye-catching locations gives a huge advantage to the builder. The team of the group always stays geared up to provide the constructions that will put immense value in the market and bring outstanding projects.<\/p>\n\n\n\n<p>Location Is Unmatched- Go Back To The Roots Of Delhi<\/p>\n\n\n\n<p>This housing community is planned in the location- of Main Bijwasan Road which will bring manifold benefits. It is rightly placed at the intersection of Gurgaon and Dwarka amidst Pushpanjali Greens. It is one of the finest locations in Delhi NCR that brings seamless connectivity and matchless proximity to Aeocity and Delhi Airport.<\/p>\n\n\n\n<p>Educational institutes:<\/p>\n\n\n\n<p>Vasant Valley School, DPS Dwarka, Max Fort School, and Sri Ram School<\/p>\n\n\n\n<p>Hotels in The Vicinity:<\/p>\n\n\n\n<p>Trident Hotel, Hyatt Regency Taj, Vivanta Hotel, and Crown Plaza Hotel<\/p>\n\n\n\n<p>Prominent Malls:<\/p>\n\n\n\n<p>Ambience Mall Gurgaon, Ambience Vasant Kunj, DLF Promenade, and DLF Cyber Hub<\/p>\n\n\n\n<p>Hospitals Around:<\/p>\n\n\n\n<p>Fortis Hospital Vasant Kunj, Manipal Hospital Dwarka, Max Hospital Dwarka, and Medanta Medicity<\/p>\n\n\n\n<p>Nearby Connectivity:<\/p>\n\n\n\n<p>Dwarka Expressway 248B, Gurgaon Border 02 Km, Delhi – Jaipur Expressway (NH8), HUDA City Centre Metro Station, IGI Airport 7 Mins, Aero City 4 Mins, and Sector 21 Dwarka Metro.<\/p>\n\n\n\n<p>Conveniences At Par Level<\/p>\n\n\n\n<p>50 + Gourmet Restaurants<br>10 + Shopping Malls<br>10 + Leading Schools<br>10 + Top Health Care Facilities<br>Tripundra Residences New Delhi is a stone&#8217;s throw away from Pushpanjali Farms, West End Greens, Vasant Vihar, and Dwarka. Being located on the Main Bijwasan Road this housing community will bring maximum ROIs. With the revolutionary changes, this real estate market is witnessing this location will see prolific growth in the coming years, so investment over here at this time will be the smartest decision of your life.<\/p>\n\n\n\n<p>TARC Tripundra Delhi- Project For The Elevation Of Living Standards<\/p>\n\n\n\n<p>Fully-fitted spaces and luxury: Well expansive space is offered here where 190 families can stay and enjoy the beautiful options provided here. Tripundra is the community where every corner is created to add a feeling of belonging.<\/p>\n\n\n\n<p>Well thought out apartments: Here the blend of fully-loaded 3 BHK and 4 BHK apartments is offered. Each unit is planned in a way to bring an abundance of opulence and the living with so much goodness. These apartments will add grace to living with the following features:<\/p>\n\n\n\n<p>Italian Marble Flooring and Laminated Wooden Floors<br>VRV Air-conditioning for incessant comfort<br>Air Purifier to ensure that you and your family breathe healthily<br>Tripundra housing community provides you with the space that’s built around your comfort. It comes with a design that you can customize according to your choice and also ensures elegant living. Here you get the custom design options and flexible layout plans to let you create a space that looks striking. 10’3” Floor to Floor Height for that diminutive extra space between you and the roof. Each apartment is with elegant light fittings adding a contemporary touch to your abode.<\/p>\n\n\n\n<p>Get The Wholesome Living Experience Here:<\/p>\n\n\n\n<p>Cycling track to let your heart pump a little faster<br>Joggers track to let your morning start fresh &amp; healthy<br>Yoga center to boost your chakras surrounded by peace.<br>Organic juice bar to let you sip the goodness anytime<br>State-of-the-art gym to sweat out the toxins with modern equipment<br>Rejuvenate Yourself In A Day Full Of Hustles:<\/p>\n\n\n\n<p>Professionally managed salon to take a dive into gorgeousness<br>Zen garden with a water body reflecting the natural beauty<br>World-class sauna and spa to let the body revive and soothe<br>Indoor heated pool to let you feel the heat in freezing cold<br>Outdoor pool to feel the cold in the scorching heat<br>Kids pool to have their own fun time with their friends<br>Get Yourself In Touch With The Aesthetic Roots:<\/p>\n\n\n\n<p>The organic garden where you can grow organic veggies<br>Pottery barn to pump the artist inside you by getting hands dirtier and soul cleaner<br>Prayer room to heal the inner self to the core<br>Artists corner to evolve the artist hidden inside you<br>Disconnected Feels So Connected Here:<\/p>\n\n\n\n<p>Enjoy the outdoor dining under the sky of stars<br>Enjoy the healthy-happy meal having lip-smacking cuisines<br>Build some memories with friends and family in the multipurpose zone<br>Cheers the happy times with your friends and family at the bar<br>Fill the world with food and joy at the barbeque pits on the terrace<br>Sip the refreshing coffee at the café<br>Sleep With An Absolute Peace Of Mind- 7D Security Is Here<\/p>\n\n\n\n<p>Gated community with Tech\/Mobile app-based System<br>CCTV camera surveillance monitored by professional security<br>Restrict unwanted entry and exit with Automatic Boom Barriers<br>The periphery of the complex is covered with a High Green Wall blocking trespassing<br>Restriction to the entry of tower controlled by the smart cards<br>All the floors monitored by CCTV in the lift cars<br>Smart lock and video phones at the apartment door<br>Panic button for emergencies and verified gate entry<br>Taste The Stress-Free Living With Maximum Safety Measures:<\/p>\n\n\n\n<p>Earthquake compliant structure with a super secure foundation<br>Framework and guidelines following global safety standards<br>Construction, design, occupation, and the management following safety standards<br>Entire year preparedness for emergencies ensuring safety and peace of living<br>Home Fulfilling The Needs Of Today With The Help Of Smart Technologies:<\/p>\n\n\n\n<p>Experience the smart living balancing the needs of today &amp; tomorrow<br>Appliances to lights, everything application controlled<br>Community application for the convenience of residents<br>Stay connected with the Wi-Fi enabled in common areas<br>EV charging points for the eco-friendly woke to be in you<br>Looking Way Forward…<br>With the perfect blend of property, builder, and location, TARC Tripundra is a property to own. This is a kind of rare option that appears in the market very less. Embedded with opulent luxury and a modular concept of living it is a property not to be missed. Don’t blink your eye until you are booking this project.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tripundra- The name of the project has been chosen very smartly, the property not just attracts the investors but the name also catches the attention of the market. Tripundra is the spiritual symbol of Lord Shiva. You must have seen the three white horizontal lines with a red dot in the center. Sacred ash is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_joinchat":[]},"categories":[23],"tags":[24],"_links":{"self":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2492"}],"collection":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/comments?post=2492"}],"version-history":[{"count":1,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2492\/revisions"}],"predecessor-version":[{"id":2493,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2492\/revisions\/2493"}],"wp:attachment":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/media?parent=2492"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/categories?post=2492"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/tags?post=2492"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}