{"id":2518,"date":"2023-08-22T08:54:06","date_gmt":"2023-08-22T08:54:06","guid":{"rendered":"https:\/\/drrealty.in\/?p=2518"},"modified":"2023-08-22T08:54:07","modified_gmt":"2023-08-22T08:54:07","slug":"devika-sadar-bazar-the-commercial-jewel-of-new-delhi","status":"publish","type":"post","link":"https:\/\/drrealty.in\/devika-sadar-bazar-the-commercial-jewel-of-new-delhi\/","title":{"rendered":"Devika Sadar Bazar: The Commercial Jewel of New Delhi"},"content":{"rendered":"\n<p>Devika Sadar Bazar Group delivers the retailers with all kinds of facilities they ever require and more. Moreover, the commercial hub has the best location advantage, the oldest and most popular hub of Delhi, Sadar BazarCommercial jewel of New Delhi at Sadar Bazar.<br>India, 21st January 2022: Devika Groups, one of the most renowned builders of the country, has announced its latest project, making it one of the finest commercial hubs of the National Capital. Titled Devika Sadar Bazar, this commercial hub will come with international level amenities, available for the retailers as well as the visitors.<br>This promising project by Devika Group delivers the retailers with all kinds of facilities they ever require and more. Moreover, the commercial hub has the best location advantage, the oldest and most popular hub of Delhi, Sadar Bazar.<br>The commercial hub covers a vast area of more than 1600 Sq. Yards with a capacity of nearly 90 shops on the ground floor and the first floor. The easily accessible location of Devika Sadar Bazar makes the commute effortless and ensures a high number of footfalls<br>The infrastructure of the commercial hub deserves a lot of appreciation for its stunning design and state-of-the-art engineering. The modern and efficient craftsmanship adds to the visual appeal and lasting attractiveness of the structure, making it a standout piece of work in the entire Sadar Bazar.<br>The Devika Sadar Bazar commercial hub also addresses all the common issues faced by the retailers of the market. Thereby, it solves one of the biggest headaches of the bazar by providing a multilevel car parking facility of more than 200 cars allotted by NDMC under Public, private partnership mode.<br>Devika Sadar Bazar is a unique concept with parking in the basement till minus 2 level, a commercial hub on the ground and first floor; and 2 floors of parking on the second and third floor.<br>The commercial hub will have stand-alone shops on the ground floor and a world class food court on the first floor. Devika Group has already signed leases with various MNC brands for the food court.<br>Devika Sadar Bazar is offering a lucrative opportunity to buy a pre-leased high rental shops and food court for its customers. The commercial hub will also have completely air-conditioned common areas, both on the ground and the first floor. Upon its inauguration, the hub is expected to witness a footfall of 1 lakh every day.<br>The USP of Devika Sadar Bazar is location, location, location. The commercial hub shares close proximity with the New Delhi Railway Station, New Delhi Metro Station, Chandni Chowk, and Kashmiri Gate at a distance of just 1 km. Furthermore, other popular areas of Delhi, like Connaught Place, is located at a distance of 3 km and the Indira Gandhi International Airport at a distance of 16 km from the Sadar Bazar.<br>Devika Sadar will emerge as the only commercial hub in one of the most popular marketplaces of New Delhi, which has a grand infrastructure and multilevel parking facilities. The commercial hub also provides clean toilets, power backup, 24\/7 security to the retailers of Devika Sadar Bazar.<br>Devika Sadar Bazar with its impressive structure and plan, has acquired the allotment rights from NDMC with all the government dues paid and all kinds of approvals in place. With a renowned and most reputed name of the industry powering the construction of the hub, Devika Sadar Bazar will cater to a completely new shopping experience in New Delhi.<br>To Know More Visit -www.drrealty.in<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Devika Sadar Bazar Group delivers the retailers with all kinds of facilities they ever require and more. Moreover, the commercial hub has the best location advantage, the oldest and most popular hub of Delhi, Sadar BazarCommercial jewel of New Delhi at Sadar Bazar.India, 21st January 2022: Devika Groups, one of the most renowned builders of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_joinchat":[]},"categories":[25],"tags":[26],"_links":{"self":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2518"}],"collection":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/comments?post=2518"}],"version-history":[{"count":1,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2518\/revisions"}],"predecessor-version":[{"id":2519,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2518\/revisions\/2519"}],"wp:attachment":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/media?parent=2518"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/categories?post=2518"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/tags?post=2518"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}