{"id":2523,"date":"2023-08-24T08:06:56","date_gmt":"2023-08-24T08:06:56","guid":{"rendered":"https:\/\/drrealty.in\/?p=2523"},"modified":"2023-08-24T08:06:57","modified_gmt":"2023-08-24T08:06:57","slug":"devika-sadar-bazar-offers-retails-shops-lockable-shops-heart-of-delhi","status":"publish","type":"post","link":"https:\/\/drrealty.in\/devika-sadar-bazar-offers-retails-shops-lockable-shops-heart-of-delhi\/","title":{"rendered":"Devika Sadar Bazar Offers Retails Shops &amp; lockable shops Heart Of Delhi"},"content":{"rendered":"\n<p><br>Looking for Spacious Retails Shops &amp; lockable shops – come to devika sadar bazar- a new commercial development by well known player Devika Group properties. This new commercial project has got Multi-level Car Parking in Delhi. Devika Sadar Bazar is loaded with plethora of smart amenities to give your business an upper hand. It is a development that is intelligently designed to give you more space and good visibility. Spread over 1335 sq meters of Plot Area, this is a Hot Commercial Space at sadar bazar in Old Delhi.<\/p>\n\n\n\n<p>Highlights<br>1335 sq. meters of Plot Area.<br>Project – Multilevel Car Parking allotted by NDMC under Public private partnership mode.<br>Ground &amp; First floors for Retail with lockable shops<br>Air-conditioned common areas on ground and first floor.<br>Limited shops\/ offices with flexible payment plans.<br>Modern elevation and lighting in the building.<br>Location Advantage<br>16 KM away from Indira Gandhi International Airport and It’s take around 25 to 30 minutes to reach IGI Airport<br>Devika Sadar Bazar Connectivity<br>Easy connectivity to Ghaziabad, Noida, Faridabad, Gurgaon and most part of Delhi<br>Devika Sadar Bazar Train- 1 KM away from New Delhi Railway Station<br>Devika Sadar Bazar Metro- 1 KM away from New Delhi Metro Station<br>About Developer<br>The developer is one of the smartest real estate players in National Capital Region. However the developer has deliberately offered business spaces amidst plush locality to push the sales of the businesses products and services up thereby benefiting all. The development offers amenities like Waste Disposal, round the clock security, Fire suppression system, Maintenance Staff, Fire Alarm system, Hi speed Safe lifts and Visitor Parking spaces..<\/p>\n\n\n\n<p>Pragati Group is a part of a leading real estate conglomerate Devika Promoter &amp; Builders. The group laid its foundation in 1956 and since then Devika Group properties have established a strong presence in the real estate landscape of Delhi &amp; NCR. The Group possesses more than 65 years of expertise in serving the delight to home buyers in the domain of residential and commercial properties.<\/p>\n\n\n\n<p>The group has already constructed a number of skyscrapers in and around Delhi. It’s a residential and commercial properties in India have set a landmark in the region. High-rise commercial buildings like Devika Tower in Nehru Place, Pragati Tower in Rajendra Place, and Devika Tower in Chander Nagar and luxurious residential complexes such as Devika Group Apartments, Pragati Group Flats and Devika Apartments in Vaishali are some of the prestigious projects of the Group.<\/p>\n\n\n\n<p>Why Invest in Devika ?<br>Commercial Shops (Limited Inventory)<br>Low Maintenance cost<br>Located in heart of Delhi ensuring high number of footfalls<br>Modern &amp; efficient design<br>100% Power Backup<br>Multi level Car parking<br>Construction in Progress, Possession soon<br>Wide range of facilities &amp; hygiene<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Looking for Spacious Retails Shops &amp; lockable shops – come to devika sadar bazar- a new commercial development by well known player Devika Group properties. This new commercial project has got Multi-level Car Parking in Delhi. Devika Sadar Bazar is loaded with plethora of smart amenities to give your business an upper hand. It is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_joinchat":[]},"categories":[25],"tags":[26],"_links":{"self":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2523"}],"collection":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/comments?post=2523"}],"version-history":[{"count":1,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2523\/revisions"}],"predecessor-version":[{"id":2524,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/posts\/2523\/revisions\/2524"}],"wp:attachment":[{"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/media?parent=2523"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/categories?post=2523"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/drrealty.in\/wp-json\/wp\/v2\/tags?post=2523"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}